// Создать класс Employee.
//В теле класса создать пользовательский конструктор, который принимает два строковых аргумента,
//и инициализирует поля, соответствующие фамилии и имени сотрудника.
// Создать метод рассчитывающий оклад сотрудника (в зависимости от должности и стажа) и налоговый сбор.
// Написать программу, которая выводит на экран информацию о сотруднике (фамилия, имя, должность), оклад и налоговый сбор.

using System;
using ConsoleApp2;

class Program
{
    static void Main()
    {
        Employee employee = new Employee("Vasya", "Pupkin", 2, "mid");
        employee.ShowEmployee();
    }
}